# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

network = input('Enter network and mask: ')
ip = (network.split('/')[0]).split('.')
mask = int(network.split('/')[1])

ip = list(map(int, ip))
ip_bin = """  
{0[0]:<8}  {0[1]:<8}  {0[2]:<8}  {0[3]:<8}  
{0[0]:08b}  {0[1]:08b}  {0[2]:08b}  {0[3]:08b}  
"""
print('\nNetwork: ' + ip_bin.format(ip))

mask_bin = '1' * mask + '0' * (32 - mask)
mask_bin_separated = [int(mask_bin[0:8], 2), int(mask_bin[8:16], 2), int(mask_bin[16:24], 2), int(mask_bin[24:32], 2)]

mask_bin_separated_dict = """
Mask:
/{1}
{0[0]:<8}  {0[1]:<8}  {0[2]:<8}  {0[3]:<8}
{0[0]:08b}  {0[1]:08b}  {0[2]:08b}  {0[3]:08b}
"""

print(mask_bin_separated_dict.format(mask_bin_separated, mask))
